In [3]:
import pandas as pd
import matplotlib.pyplot as plt

### Heart Disease Mortality
<p>The annual number of deaths from cardiovascular diseases per 100,000 people.</p>

In [2]:
df = pd.read_csv('HeartDiseaseMortality.csv')

In [4]:
df.head(3)

,Entity,Code,Year,Deaths - Cardiovascular diseases - Sex: Both - Age: Age-standardized (Rate)
0,Afghanistan,AFG,1990,747.110547
1,Afghanistan,AFG,1991,746.567118
2,Afghanistan,AFG,1992,749.068968

In [7]:
df.columns

Index(['Entity', 'Code', 'Year',
       'Deaths - Cardiovascular diseases - Sex: Both - Age: Age-standardized (Rate)'],
      dtype='object')

In [8]:
df.rename(columns = {'Deaths - Cardiovascular diseases - Sex: Both - Age: Age-standardized (Rate)':'Deaths'}, inplace=True)

In [9]:
df.head(5)

        Entity Code  Year      Deaths
0  Afghanistan  AFG  1990  747.110547
1  Afghanistan  AFG  1991  746.567118
2  Afghanistan  AFG  1992  749.068968
3  Afghanistan  AFG  1993  755.922388
4  Afghanistan  AFG  1994  766.065707

##### Selecting Time Frame

In [11]:
data = df[(df['Year'] > 2006) & (df['Year'] < 2012)]

In [13]:
data.reset_index(inplace = True)

In [16]:
data.drop('index', axis=1, inplace = True)

C:\Users\mauri\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

##### Data in now in the format we want

In [26]:
data.head(5)

        Entity Code  Year      Deaths
0  Afghanistan  AFG  2007  707.188774
1  Afghanistan  AFG  2008  693.448663
2  Afghanistan  AFG  2009  677.845507
3  Afghanistan  AFG  2010  662.616946
4  Afghanistan  AFG  2011  649.725628

##### Verification each country has 5 years (2007-2011)

In [25]:
data.pivot_table(columns=['Code'], aggfunc='size')

Code
AFG    5
AGO    5
ALB    5
AND    5
ARE    5
      ..
WSM    5
YEM    5
ZAF    5
ZMB    5
ZWE    5
Length: 196, dtype: int64

In [27]:
data[data['Code'] == 'USA']

             Entity Code  Year      Deaths
1085  United States  USA  2007  171.669494
1086  United States  USA  2008  167.152185
1087  United States  USA  2009  161.941059
1088  United States  USA  2010  156.111419
1089  United States  USA  2011  154.961471

In [28]:
data.to_csv('HeartDiseaseMortality2007_2011.csv')